{"id":"surah_41","ayah_1":"Ha, Meem.","ayah_2":"[This is] a revelation from the Entirely Merciful, the Especially Merciful -","ayah_3":"A Book whose verses have been detailed, an Arabic Qur'an for a people who know,","ayah_4":"As a giver of good tidings and a warner; but most of them turn away, so they do not hear.","ayah_5":"And they say, \"Our hearts are within coverings from that to which you invite us, and in our ears is deafness, and between us and you is a partition, so work; indeed, we are working.\"","ayah_6":"Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -","ayah_7":"Those who do not give zakah, and in the Hereafter they are disbelievers.","ayah_8":"Indeed, those who believe and do righteous deeds -  for them is a reward uninterrupted.","ayah_9":"Say, \"Do you indeed disbelieve in He who created the earth in two days and attribute to Him equals? That is the Lord of the worlds.\"","ayah_10":"And He placed on the earth firmly set mountains over its surface, and He blessed it and determined therein its [creatures'] sustenance in four days without distinction -  for [the information] of those who ask.","ayah_11":"Then He directed Himself to the heaven while it was smoke and said to it and to the earth, \"Come [into being], willingly or by compulsion.\" They said, \"We have come willingly.\"","ayah_12":"And He completed them as seven heavens within two days and inspired in each heaven its command. And We adorned the nearest heaven with lamps and as protection. That is the determination of the Exalted in Might, the Knowing.","ayah_13":"But if they turn away, then say, \"I have warned you of a thunderbolt like the thunderbolt [that struck] 'Aad and Thamud.","ayah_14":"[That occurred] when the messengers had come to them before them and after them, [saying], \"Worship not except Allah .\" They said, \"If our Lord had willed, He would have sent down the angels, so indeed we, in that with which you have been sent, are disbelievers.\"","ayah_15":"As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs.","ayah_16":"So We sent upon them a screaming wind during days of misfortune to make them taste the punishment of disgrace in the worldly life; but the punishment of the Hereafter is more disgracing, and they will not be helped.","ayah_17":"And as for Thamud, We guided them, but they preferred blindness over guidance, so the thunderbolt of humiliating punishment seized them for what they used to earn.","ayah_18":"And We saved those who believed and used to fear Allah .","ayah_19":"And [mention, O Muhammad], the Day when the enemies of Allah will be gathered to the Fire while they are [driven] assembled in rows,","ayah_20":"Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.","ayah_21":"And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.","ayah_22":"And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do.","ayah_23":"And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\"","ayah_24":"So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [ Allah ], they will not be of those who are allowed to appease.","ayah_25":"And We appointed for them companions who made attractive to them what was before them and what was behind them [of sin], and the word has come into effect upon them among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.","ayah_26":"And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\"","ayah_27":"But We will surely cause those who disbelieve to taste a severe punishment, and We will surely recompense them for the worst of what they had been doing.","ayah_28":"That is the recompense of the enemies of Allah -  the Fire. For them therein is the home of eternity as recompense for what they, of Our verses, were rejecting.","ayah_29":"And those who disbelieved will [then] say, \"Our Lord, show us those who misled us of the jinn and men [so] we may put them under our feet that they will be among the lowest.\"","ayah_30":"Indeed, those who have said, \"Our Lord is Allah \" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised.","ayah_31":"We [angels] were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]","ayah_32":"As accommodation from a [Lord who is] Forgiving and Merciful.\"","ayah_33":"And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"","ayah_34":"And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.","ayah_35":"But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].","ayah_36":"And if there comes to you from Satan an evil suggestion, then seek refuge in Allah . Indeed, He is the Hearing, the Knowing."}
