{"id":"surah_3","ayah_125":"Yes, if you remain patient and conscious of Allah and the enemy come upon you [attacking] in rage, your Lord will reinforce you with five thousand angels having marks [of distinction]","ayah_126":"And Allah made it not except as [a sign of] good tidings for you and to reassure your hearts thereby. And victory is not except from Allah, the Exalted in Might, the Wise -","ayah_127":"That He might cut down a section of the disbelievers or suppress them so that they turn back disappointed.","ayah_128":"Not for you, [O Muhammad, but for Allah ], is the decision whether He should [cut them down] or forgive them or punish them, for indeed, they are wrongdoers.","ayah_129":"And to Allah belongs whatever is in the heavens and whatever is on the earth. He forgives whom He wills and punishes whom He wills. And Allah is Forgiving and Merciful.","ayah_130":"O you who have believed, do not consume usury, doubled and multiplied, but fear Allah that you may be successful.","ayah_131":"And fear the Fire, which has been prepared for the disbelievers.","ayah_132":"And obey Allah and the Messenger that you may obtain mercy.","ayah_133":"And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous","ayah_134":"Who spend [in the cause of Allah ] during ease and hardship and who restrain anger and who pardon the people -  and Allah loves the doers of good;","ayah_135":"And those who, when they commit an immorality or wrong themselves [by transgression], remember Allah and seek forgiveness for their sins -  and who can forgive sins except Allah ? -  and [who] do not persist in what they have done while they know.","ayah_136":"Those -  their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers.","ayah_137":"Similar situations [as yours] have passed on before you, so proceed throughout the earth and observe how was the end of those who denied.","ayah_138":"This [Qur'an] is a clear statement to [all] the people and a guidance and instruction for those conscious of Allah .","ayah_139":"So do not weaken and do not grieve, and you will be superior if you are [true] believers.","ayah_140":"If a wound should touch you -  there has already touched the [opposing] people a wound similar to it. And these days [of varying conditions] We alternate among the people so that Allah may make evident those who believe and [may] take to Himself from among you martyrs -  and Allah does not like the wrongdoers -","ayah_141":"And that Allah may purify the believers [through trials] and destroy the disbelievers.","ayah_142":"Or do you think that you will enter Paradise while Allah has not yet made evident those of you who fight in His cause and made evident those who are steadfast?","ayah_143":"And you had certainly wished for martyrdom before you encountered it, and you have [now] seen it [before you] while you were looking on.","ayah_144":"Muhammad is not but a messenger. [Other] messengers have passed on before him. So if he was to die or be killed, would you turn back on your heels [to unbelief]? And he who turns back on his heels will never harm Allah at all; but Allah will reward the grateful.","ayah_145":"And it is not [possible] for one to die except by permission of Allah at a decree determined. And whoever desires the reward of this world -  We will give him thereof; and whoever desires the reward of the Hereafter -  We will give him thereof. And we will reward the grateful.","ayah_146":"And how many a prophet [fought and] with him fought many religious scholars. But they never lost assurance due to what afflicted them in the cause of Allah, nor did they weaken or submit. And Allah loves the steadfast.","ayah_147":"And their words were not but that they said, \"Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.\"","ayah_148":"So Allah gave them the reward of this world and the good reward of the Hereafter. And Allah loves the doers of good.","ayah_149":"O you who have believed, if you obey those who disbelieve, they will turn you back on your heels, and you will [then] become losers.","ayah_150":"But Allah is your protector, and He is the best of helpers.","ayah_151":"We will cast terror into the hearts of those who disbelieve for what they have associated with Allah of which He had not sent down [any] authority. And their refuge will be the Fire, and wretched is the residence of the wrongdoers.","ayah_152":"And Allah had certainly fulfilled His promise to you when you were killing the enemy by His permission until [the time] when you lost courage and fell to disputing about the order [given by the Prophet] and disobeyed after He had shown you that which you love. Among you are some who desire this world, and among you are some who desire the Hereafter. Then he turned you back from them [defeated] that He might test you. And He has already forgiven you, and Allah is the possessor of bounty for the believers.","ayah_153":"[Remember] when you [fled and] climbed [the mountain] without looking aside at anyone while the Messenger was calling you from behind. So Allah repaid you with distress upon distress so you would not grieve for that which had escaped you [of victory and spoils of war] or [for] that which had befallen you [of injury and death]. And Allah is [fully] Acquainted with what you do.","ayah_154":"Then after distress, He sent down upon you security [in the form of] drowsiness, overcoming a faction of you, while another faction worried about themselves, thinking of Allah other than the truth -  the thought of ignorance, saying, \"Is there anything for us [to have done] in this matter?\" Say, \"Indeed, the matter belongs completely to Allah .\" They conceal within themselves what they will not reveal to you. They say, \"If there was anything we could have done in the matter, some of us would not have been killed right here.\" Say, \"Even if you had been inside your houses, those decreed to be killed would have come out to their death beds.\" [It was] so that Allah might test what is in your breasts and purify what is in your hearts. And Allah is Knowing of that within the breasts.","ayah_155":"Indeed, those of you who turned back on the day the two armies met, it was Satan who caused them to slip because of some [blame] they had earned. But Allah has already forgiven them. Indeed, Allah is Forgiving and Forbearing.","ayah_156":"O you who have believed, do not be like those who disbelieved and said about their brothers when they traveled through the land or went out to fight, \"If they had been with us, they would not have died or have been killed,\" so Allah makes that [misconception] a regret within their hearts. And it is Allah who gives life and causes death, and Allah is Seeing of what you do.","ayah_157":"And if you are killed in the cause of Allah or die -  then forgiveness from Allah and mercy are better than whatever they accumulate [in this world].","ayah_158":"And whether you die or are killed, unto Allah you will be gathered.","ayah_159":"So by mercy from Allah, [O Muhammad], you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah . Indeed, Allah loves those who rely [upon Him].","ayah_160":"If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him? And upon Allah let the believers rely.","ayah_161":"It is not [attributable] to any prophet that he would act unfaithfully [in regard to war booty]. And whoever betrays, [taking unlawfully], will come with what he took on the Day of Resurrection. Then will every soul be [fully] compensated for what it earned, and they will not be wronged.","ayah_162":"So is one who pursues the pleasure of Allah like one who brings upon himself the anger of Allah and whose refuge is Hell? And wretched is the destination.","ayah_163":"They are [varying] degrees in the sight of Allah, and Allah is Seeing of whatever they do.","ayah_164":"Certainly did Allah confer [great] favor upon the believers when He sent among them a Messenger from themselves, reciting to them His verses and purifying them and teaching them the Book and wisdom, although they had been before in manifest error.","ayah_165":"Why [is it that] when a [single] disaster struck you [on the day of Uhud], although you had struck [the enemy in the battle of Badr] with one twice as great, you said, \"From where is this?\" Say, \"It is from yourselves.\" Indeed, Allah is over all things competent.","ayah_166":"And what struck you on the day the two armies met was by permission of Allah that He might make evident the [true] believers.","ayah_167":"And that He might make evident those who are hypocrites. For it was said to them, \"Come, fight in the way of Allah or [at least] defend.\" They said, \"If we had known [there would be] fighting, we would have followed you.\" They were nearer to disbelief that day than to faith, saying with their mouths what was not in their hearts. And Allah is most Knowing of what they conceal -","ayah_168":"Those who said about their brothers while sitting [at home], \"If they had obeyed us, they would not have been killed.\" Say, \"Then prevent death from yourselves, if you should be truthful.\"","ayah_169":"And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision,","ayah_170":"Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them -  that there will be no fear concerning them, nor will they grieve.","ayah_171":"They receive good tidings of favor from Allah and bounty and [of the fact] that Allah does not allow the reward of believers to be lost -","ayah_172":"Those [believers] who responded to Allah and the Messenger after injury had struck them. For those who did good among them and feared Allah is a great reward -","ayah_173":"Those to whom hypocrites said, \"Indeed, the people have gathered against you, so fear them.\" But it [merely] increased them in faith, and they said, \"Sufficient for us is Allah, and [He is] the best Disposer of affairs.\"","ayah_174":"So they returned with favor from Allah and bounty, no harm having touched them. And they pursued the pleasure of Allah, and Allah is the possessor of great bounty.","ayah_175":"That is only Satan who frightens [you] of his supporters. So fear them not, but fear Me, if you are [indeed] believers.","ayah_176":"And do not be grieved, [O Muhammad], by those who hasten into disbelief. Indeed, they will never harm Allah at all. Allah intends that He should give them no share in the Hereafter, and for them is a great punishment.","ayah_177":"Indeed, those who purchase disbelief [in exchange] for faith -  never will they harm Allah at all, and for them is a painful punishment.","ayah_178":"And let not those who disbelieve ever think that [because] We extend their time [of enjoyment] it is better for them. We only extend it for them so that they may increase in sin, and for them is a humiliating punishment.","ayah_179":"Allah would not leave the believers in that [state] you are in [presently] until He separates the evil from the good. Nor would Allah reveal to you the unseen. But [instead], Allah chooses of His messengers whom He wills, so believe in Allah and His messengers. And if you believe and fear Him, then for you is a great reward.","ayah_180":"And let not those who [greedily] withhold what Allah has given them of His bounty ever think that it is better for them. Rather, it is worse for them. Their necks will be encircled by what they withheld on the Day of Resurrection. And to Allah belongs the heritage of the heavens and the earth. And Allah, with what you do, is [fully] Acquainted.","ayah_181":"Allah has certainly heard the statement of those [Jews] who said, \"Indeed, Allah is poor, while we are rich.\" We will record what they said and their killing of the prophets without right and will say, \"Taste the punishment of the Burning Fire.","ayah_182":"That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"","ayah_183":"[They are] those who said, \"Indeed, Allah has taken our promise not to believe any messenger until he brings us an offering which fire [from heaven] will consume.\" Say, \"There have already come to you messengers before me with clear proofs and [even] that of which you speak. So why did you kill them, if you should be truthful?\"","ayah_184":"Then if they deny you, [O Muhammad] -  so were messengers denied before you, who brought clear proofs and written ordinances and the enlightening Scripture.","ayah_185":"Every soul will taste death, and you will only be given your [full] compensation on the Day of Resurrection. So he who is drawn away from the Fire and admitted to Paradise has attained [his desire]. And what is the life of this world except the enjoyment of delusion.","ayah_186":"You will surely be tested in your possessions and in yourselves. And you will surely hear from those who were given the Scripture before you and from those who associate others with Allah much abuse. But if you are patient and fear Allah -  indeed, that is of the matters [worthy] of determination."}
